[
  {
    id: "1",
    label: "Борба",
    type: "произведение",
    year: 1876,
    image: "",
    externalLink: "",
    description: `Поемата на Христо Ботев е пламенен призив за борба срещу социалното потисничество и тиранията. Тя изобличава несправедливостта и призовава народа към революция.
      Обществото и властта: Произведението пряко се противопоставя на потисническата власт (османско владичество) и нейното въздействие върху обществото, призовавайки към борба за свобода и справедливост.`,
    tags: ["Революционна лирика", "Героическа поезия"],
  },
  {
    id: "Botev",
    label: "Христо Ботев",
    type: "автор",
    year: 1848,
    image: "",
    externalLink: "",
    description:
      "Христо Ботев е един от най-великите български поети и революционери, чието творчество е изцяло посветено на борбата за национално освобождение и социална справедливост.",
    tags: ["Революционер", "Поет"],
  },
  // TODO 100
  {
    id: "4",
    label: "Депутатът с побърканите местоимения",
    type: "произведение",
    year: 1923,
    image: "",
    externalLink: "",
    description: `В този фейлетон, депутатът използва грешни местоимения (която вместо което). Целта на произведението е да усмие ниската грамотност на депутатите и да покаже циркаджийския начин, по който се държат в народното събрание.
  
      **Обществото и властта:** Творбата остро критикува политическата класа и нейната некомпетентност
      
      Цитат: Никой няма право да критикува почитаемото правителство, която е гордост за България. Долу-у-у!
      `,
    tags: ["Сатира?", "Социална критика?"],
  },
  {
    id: "Aleko",
    label: "Алеко Константинов",
    type: "автор",
    year: 1863,
    image: "",
    externalLink: "",
    description:
      "Алеко Константинов е бележит български писател и общественик, известен със своите сатирични произведения, които критикуват пороците на следосвобожденското българско общество и политическия живот.",
    tags: ["Сатирик", "Пътеписец"],
  },
  {
    id: "theme1",
    label: "Политическа некомпетентност",
    type: "тема",
    image: "",
    externalLink: "",
    description:
      "Тема, която разглежда неспособността или липсата на квалификация у управляващите да изпълняват своите задължения ефективно, често водеща до вреди за обществото.",
    tags: [],
  },
  {
    id: "theme3",
    label: "Политическо безразличие",
    type: "тема",
    image: "",
    externalLink: "",
    description:
      "Тема, отразяваща апатията и липсата на интерес на гражданите към политическия живот и управлението, което често води до утвърждаване на нежелани режими или практики.",
    tags: [],
  },
  {
    id: "theme4",
    label: "Опияняващата власт",
    type: "тема",
    image: "",
    externalLink: "",
    description:
      "Тази тема изследва как властта може да поквари индивида, като го накара да забрави своите принципи и да действа тиранично, отчуждавайки го от обществото.",
    tags: [],
  },
  {
    id: "Geo",
    label: "Гео Милев",
    type: "автор",
    year: 1895,
    image: "https://upload.wikimedia.org/wikipedia/commons/4/4b/Geo_Milev.jpg",
    description:
      "Български поет, критик и преводач, водеща фигура на родния модернизъм. Убит през 1925 г. заради критичните си възгледи към режима. Творчеството му е силно ангажирано с обществените и политическите проблеми на своето време.",
    tags: ["Модернизъм?", "Критика на властта", "Експресионизъм?"],
    externalLink: "https://bg.wikipedia.org/wiki/Гео_Милев",
  },
  {
    id: "Vazov",
    label: "Иван Вазов",
    type: "автор",
    year: 1850, // Коригирана година на раждане
    image: "",
    description:
      "Патриарх на българската литература, чието творчество обхваща голям период от българската история, от Възраждането до началото на XX век. Негови произведения често анализират взаимоотношенията между обществото и властта.",
    tags: ["Класик", "Патриот"],
    externalLink: "",
  },
  {
    id: "septemvri",
    label: "Септември",
    type: "произведение",
    year: 1924,
    image:
      "https://upload.wikimedia.org/wikipedia/commons/thumb/1/11/Septemvri_cover.jpg/320px-Septemvri_cover.jpg",
    externalLink: "https://bg.wikipedia.org/wiki/Септември_(поема)",
    description: `Епична поема, посветена на Септемврийското въстание (1923), в която социалните несправедливости и насилието на властта са изведени в остра поетична визия.
  
      **Обществото и властта:** Поемата е мощно обвинение срещу репресивната власт и нейното жестоко потисничество над народа. Тя показва как отчаянието и социалната несправедливост водят до бунт, илюстрирайки трагичните последици от сблъсъка между въстаниците и държавната машина.`,
    tags: ["Общество", "Власт", "Въстание", "Експресионизъм"],
  },
  {
    id: "Dimo",
    label: "Димитър Димов",
    type: "автор",
    year: 1909,
    image: "",
    externalLink: "",
    description:
      "Изтъкнат български писател, известен със своите психологически романи, които често изследват морални дилеми, сложни човешки взаимоотношения и въздействието на обществените процеси върху индивида.",
    tags: ["Психологически роман", "Модернизъм"],
  },
  {
    id: "Hristo",
    label: "Христо Смирненски",
    type: "автор",
    year: 1898,
    image: "",
    externalLink: "",
    description:
      "Христо Смирненски е един от най-значимите български поети-символисти, чието творчество е пропито със силни социални послания и критика към несправедливостите в обществото след Първата световна война. Умира 1923г. от туберколоза",
    tags: ["Символизъм", "Социална поезия"],
  },
  {
    id: "theme2",
    label: "Насилствена власт",
    type: "тема",
    image: "",
    externalLink: "",
    description:
      "Тема, която се фокусира върху използването на сила, репресии и терор от страна на управляващите за поддържане на контрол над обществото, често потискайки основните човешки права и свободи.",
    tags: [],
  },
  {
    id: "10",
    label: "Тютюн",
    type: "произведение",
    year: 1951,
    image: "",
    externalLink: "",
    description: `Мащабен роман, който описва сложната българска действителност през 40-те години на XX век, фокусирайки се върху тютюневата индустрия, класовите конфликти и моралния упадък.
  
      **Обществото и властта:** Романът ярко показва сложната връзка между икономическата (тютюневи концерни) и политическата власт, разкривайки експлоатацията на работниците, корупцията и идеологическите сблъсъци, които прекрояват обществото и властовите отношения. Той изследва как властта влияе на съдбите на хората и как индивидуалните избори се преплитат с големите исторически промени.`,
    tags: ["Социален роман", "Психологически роман", "Исторически роман"],
  },
  // TODO finish
  {
    id: "10b",
    label: "Приказка за стълбата",
    type: "произведение",
    year: 1923,
    image: "",
    externalLink: "",
    description: `Алегорична творба на Христо Смирненски, в която човек, изкачвайки се по стълбата на властта, постепенно губи своята човечност и идеали, превръщайки се в тиранин.
  
      **Обществото и властта:** Това е остра критика на това как властта покварява и отчуждава индивида от неговите морални ценности и от народа, който трябва да служи. Тя символизира пътя към властта като път на компромиси и предателства, водещи до потисничество и морален упадък.`,
    tags: ["Алегория", "Нравственост"],
  },
  {
    id: "11",
    label: "Андрешко",
    type: "произведение",
    year: 1903,
    image: "",
    externalLink: "",
    description: `Разказ от Елин Пелин за селянина Андрешко, който надхитрява съдия-изпълнител, опитващ се да конфискува имуществото на беден селянин.
  
      **Обществото и властта:** Произведението пряко разглежда конфликта между обикновените хора и равнодушието на държавната машина.`,
    tags: ["Разказ", "Социален реализъм"],
  },
  {
    id: "Lubo",
    label: "Любен Каравелов",
    type: "автор",
    year: 1834,
    image: "",
    externalLink: "",
    description:
      "Любен Каравелов е виден български писател, публицист и революционер, изиграл ключова роля в българското национално възраждане. Творчеството му често засяга социални и политически проблеми, призовавайки към справедливост и свобода.",
    tags: ["Възрожденец", "Публицист", "Революционер"],
  },
  // tODO fix ??!?!?
  {
    id: "13",
    label: "Крива ли е съдбата",
    type: "произведение",
    year: 1868,
    image: "",
    externalLink: "",
    description: `Повест от Любен Каравелов, осмиваща повърхностното усвояване на западни нрави и ценности от българското общество след Освобождението, което води до абсурдни ситуации и морални изкривявания.
  
      **Обществото и властта:** Макар и непряко за политическа власт, пиесата сатиризира стремежа към социален статус и власт чрез имитация и показност, разкривайки как външни влияния изкривяват ценностите на обществото и допринасят за неговата морална деградация.`,
    tags: ["Сатирична пиеса", "Нрави", "Социална критика"],
  },
  {
    id: "Elin",
    label: "Елин Пелин",
    type: "автор",
    year: 1877,
    image: "",
    externalLink: "",
    description:
      "Елин Пелин е един от най-значимите български разказвачи, известен с майсторското си изображение на селския живот и психологията на българския селянин. Негови произведения често засягат социални несправедливости.",
    tags: ["Разказвач", "Реализъм", "Селски живот"],
  },
  {
    id: "Vapcarov",
    label: "Никола Вапцаров",
    type: "автор",
    year: 1909,
    image: "",
    externalLink: "",
    description:
      "Никола Вапцаров е виден български поет, чието творчество е силно повлияно от социалните и политическите събития от първата половина на XX век. Неговата поезия е белязана от борбата за социална справедливост и вярата в човека.",
    tags: ["Работническа поезия", "Социален реализъм", "Антифашист"], // TODO fix
  },
  // TODO fix still more fix
  {
    id: "21",
    label: "Пловдив",
    type: "произведение",
    year: 1920,
    image: "",
    externalLink:
      "https://zamatura.eu/12klas/maturi-12klas/predmeti/bel/proizvedenia/plovdiv/analiz/",
    description: `Стихотворение на Димчо Дебелянов, която представя индустриалния Пловдив и тежкия живот на работническата класа.
      **Обществото и властта:** Поемата изследва въздействието на икономическата власт (индустриалците) върху работническата класа. Тя индиректно критикува капиталистическата система и експлоататорските условия на труд, подчертавайки борбата за достойнство и колективната сила на пролетариата.`,
    tags: ["Индустриална поезия", "Социална несправедливост", "Пролетариат"],
  },
  {
    id: "22",
    label: "Под игото",
    type: "произведение",
    year: 1889,
    image: "",
    externalLink: "",
    description: `Основополагащ роман на Иван Вазов, описващ българското възраждане и подготовката за Априлското въстание срещу османското владичество. Романът е панорама на българския живот преди Освобождението, представяйки различни социални слоеве и техните настроения.
  
      **Обществото и властта:** Романът е класически пример за конфликт между потиснато общество и неговата чужда, тиранична власт (Османската империя). Той показва мобилизацията на целия народ за освобождение, както и формирането на национално самосъзнание в условията на чуждо потисничество.`,
    tags: ["Исторически роман", "Възраждане", "Националноосвободителна борба"],
  },
  // TODO rethink
  {
    id: "23",
    label: "История",
    type: "произведение",
    year: 1917,
    image: "",
    externalLink: "",
    description: `Дълбоко песимистична поема на Никола Вапцаров, която преосмисля историята като цикъл от страдание, потисничество и насилие, извършвани от силните над слабите.
  
      **Обществото и властта:** Поемата предлага сурова перспектива за властта като потисническа сила през цялата история, като запис на експлоатацията на слабите от силните. Тя подчертава цикличността на потисничеството и безсилието на обикновения човек пред историческите събития и властовите амбиции.`,
    tags: ["Песимизъм", "Социална несправедливост", "История"],
  },
  // TODO Rework
  {
    id: "24",
    label: "Истината за стълбата",
    type: "произведение",
    year: 1910,
    image: "",
    externalLink: "",
    description: `Произведение, което може да бъде разгледано като продължение или отговор на "Приказка за стълбата", задълбочаващо темата за покваряващото влияние на властта и трудностите при запазване на моралните принципи.
  
      **Обществото и властта:** Това произведение продължава размишленията за етичните компромиси, които индивидите правят в стремежа си към власт, и последствията от тях за обществото, като подчертава вечната дилема между личното издигане и общественото благо.`,
    tags: ["Алегория", "Морал", "Власт"],
  },
  // TODO fix
  {
    id: "25",
    label: "На гости у Дявола",
    type: "произведение",
    year: 1900,
    image: "",
    externalLink: "",
    description: `Сатиричен разказ от Христо Смирненски, в който адът е представен като бюрократично и морално корумпирано подобие на човешкото общество, изпълнено с пороци и несправедливост.
  
      **Обществото и властта:** Разказът е мощна сатира върху състоянието на обществото и неговите управляващи механизми. Чрез изобразяването на ада като преувеличена версия на земното съществуване, Елин Пелин критикува присъщата корупция и морален упадък в човешкото общество и неговите институции, включително тези на властта.`,
    tags: ["Сатира", "Бюрокрация", "Морален упадък"],
  },
  // TODO rework
  {
    id: "26",
    label: "Елате ни вижте",
    type: "произведение",
    year: 1920,
    image: "",
    externalLink: "",
    description: `Стихотворение, което представлява пряко обръщение към управляващите и богатите, призовавайки ги да видят мизерията и страданието на обикновените хора.
  
      **Обществото и властта:** Произведението е откровен призив за съпричастност и справедливост, изобличаващ безразличието на властта към страданията на обществото и подчертаващ острата социална диференциация.`,
    tags: ["Социална поезия", "Призив", "Несправедливост"],
  },
];
[
  { source: "Botev", target: "1", type: "автор на" }, // Борба
  { source: "theme2", target: "1", type: "тема" }, // Насилствена власт -> Борба (правилно)
  { source: "Geo", target: "septemvri", type: "автор на" }, // Септември
  { source: "Aleko", target: "4", type: "автор на" }, // Депутатът с обърканите местоимения
  { source: "theme1", target: "4", type: "тема" }, // Политическа некомпетентност -> Депутатът с обърканите местоимения (правилно)
  { source: "Dimo", target: "10", type: "автор на" }, // Тютюн
  { source: "theme4", target: "10", type: "тема" }, // Опияняващата власт -> Тютюн (правилно, покварата на властта/парите)
  { source: "Vazov", target: "22", type: "автор на" }, // Под игото
  { source: "theme2", target: "22", type: "тема" }, // Насилствена власт -> Под игото (правилно, османско иго)
  { source: "10b", target: "24", type: "повлиян" }, // Приказка за стълбата -> Истината за стълбата (логично)
  { source: "Elin", target: "11", type: "автор на" }, // Андрешко
  { source: "theme4", target: "10b", type: "тема" }, // Опияняващата власт -> Приказка за стълбата (много подходящо)
  { source: "Hristo", target: "10b", type: "автор на" }, // Христо Смирненски -> Приказка за стълбата (Преди това в sampleNodes беше Алеко Константинов, корекция тук)
  { source: "theme2", target: "septemvri", type: "тема" }, // Насилствена власт -> Септември (много подходящо)
  { source: "Vapcarov", target: "23", type: "автор на" }, // Никола Вапцаров -> История (Но според sampleNodes, "История" е от Христо Смирненски. Ще коригирам.)

  { source: "theme1", target: "13", type: "тема" }, // Политическа некомпетентност -> Крива ли е съдбата (Сатира на нравите, включително политически)
  { source: "theme3", target: "13", type: "тема" }, // Политическо безразличие -> Крива ли е съдбата (Ако сатира на обществото)
  { source: "theme4", target: "25", type: "тема" }, // Опияняващата власт -> На гости у Дявола (Корупция и власт)
  { source: "theme3", target: "26", type: "тема" }, // Политическо безразличие -> Елате ни вижте (Критика на безразличието на властта)
  { source: "theme2", target: "23", type: "тема" }, // Насилствена власт -> История (Много подходящо за песимистичната поема)
  { source: "theme2", target: "11", type: "тема" }, // Насилствена власт -> Андрешко (Конфликт с корумпираната власт)
  { source: "theme2", target: "21", type: "тема" }, // Насилствена власт -> Пловдив (Експлоатация на работниците)
  { source: "Lubo", target: "13", type: "автор на" }, // Любен Каравелов -> Крива ли е съдбата
];
